{
    "architectures": [
        "NystromformerForMaskedLM"
    ],
    "attention_probs_dropout_prob": 0.1,
    "bos_token_id": 0,
    "conv_kernel_size": 65,
    "eos_token_id": 2,
    "hidden_act": "gelu_new",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "inv_coeff_init_option": false,
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 4096,
    "model_type": "nystromformer",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "num_landmarks": 64,
    "pad_token_id": 1,
    "segment_means_seq_len": 64,
    "torch_dtype": "float32",
    "transformers_version": "4.18.0.dev0",
    "type_vocab_size": 2,
    "vocab_size": 30000
}
